<?php

error_reporting(-1);

/* Коды для замены букв */
/* $code = array(
    'а'	=>	'1',
    'б'	=>	'2',
    'в'	=>	'3',
    'г'	=>	'4',
    'д'	=>	'5',
    'е'	=>	'6',
    'ё'	=>	'7',
    'ж'	=>	'8',
    'з'	=>	'9',
    'и'	=>	'0',
    'й'	=>	'#'
);

$text = 'нас предали. явка провалена.';
$cipher = strtr($text, $code);

echo "Оригинал: {$text}<br>Шифровка: {$cipher}<br>";

echo "......................................................<br>";

$code = array_flip($code);
$cipher = strtr($text, $code);


echo "Оригинал: {$text}<br>Шифровка: {$cipher}<br>"; */

// Коды для замены букв
$code = array(
    'А'	=>	'4',
    'Б'	=>	'6',
    'В'	=>	'8',
    'Г'	=>	'r',
    'Е'	=>	'€',
    'З'	=>	'3',
    'Ж'	=>	'>|<',
    'И'	=>	'N',
    'K'	=>	'|<',
    'Л'	=>	'^',
    'С'	=>	')',
    'P'	=>	'|o',
    'У'	=>	'Y'
);

$text = 'Я У МАМЫ ПИ-ЭЙЧ-ПИ ИНЖЕНЕР-ПРОГРАММИСТ';
$l33t = strtr($text, $code);

echo "Ты говоришь: {$text}<br>А хакеры говорят: {$l33t}<br>";